ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR1986VK01/src/MDR1986VK01_eth.c
    /* Read the buffer mode */
    BufferMode = (ETHERNETx->G_CFG & ETH_G_CFG_BUFF_MODE_Msk);
    /* Send packet */
    Xtail = ETHERNETx->X_TAIL;

    switch (BufferMode)
    {
        case ETH_BUFFER_MODE_LINEAR:
            /* Set pointer to output buffer */
            ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + Xtail);
            /* Send frame */
            EthReceiverFreeBufferSize = (ETH_BUFFER_SIZE - Xtail) / 4;
            if(((BufLen + 3) / 4 + 1) < EthReceiverFreeBufferSize)
            {
                for(i = 0; i < (BufLen + 3) / 4 + 1; i++ )
                {
                    *ptr_OutputFrame++ = ptr_OutputBuffer[i];
                }
            }
            else
            {
                for( i = 0; i < EthReceiverFreeBufferSize; i++)
                {
                    *ptr_OutputFrame++ = ptr_OutputBuffer[i];
                }
                tmp = i;
                ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + ETHERNETx->DILIMETR);
                for(i = 0; i < (((BufLen + 3) / 4 + 1) - EthReceiverFreeBufferSize); i++)
                {
                    *ptr_OutputFrame++ = ptr_OutputBuffer[i+tmp];
                }
            }
            ptr_OutputFrame++;
            Xtail = (uint32_t)ptr_OutputFrame&0x17FFC;
            if(Xtail > ETH_BUFFER_SIZE)
            {
                Xtail = ETHERNETx->DILIMETR;
            }
            /* Write the new value of the ETH_X_Tail register */
            ETHERNETx->X_TAIL = Xtail;
            break;
        case ETH_BUFFER_MODE_AUTOMATIC_CHANGE_POINTERS:
            /* Set pointer to output buffer */
            ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + Xtail);
            /* Send frame */
            EthReceiverFreeBufferSize = (ETH_BUFFER_SIZE - Xtail) / 4;
            if(((BufLen + 3) / 4 + 2) < EthReceiverFreeBufferSize)
            {
                for(i = 0; i < (BufLen + 3) / 4 + 2; i++)
                {
                    *ptr_OutputFrame++ = ptr_OutputBuffer[i];
                }
            }
            else
            {
                for( i = 0; i < EthReceiverFreeBufferSize; i++ )
                {
                    *ptr_OutputFrame++ = ptr_OutputBuffer[i];
                }
                tmp = i;
                ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + ETHERNETx->DILIMETR);
                for(i = 0; i < (((BufLen + 3) / 4 + 2) - EthReceiverFreeBufferSize); i++)
                {
                    *ptr_OutputFrame++ = ptr_OutputBuffer[i+tmp];
                }
            }
            break;
        case ETH_BUFFER_MODE_FIFO:
            /* Set the pointer to input frame */
            ptr_OutputFrame = (uint32_t *) ((uint32_t)ETH_BUFF_BASE_ADDR + 0x00000004);
            ETH_DMAFrameTx(ptr_OutputFrame, ((BufLen+3)/4 + 2), ptr_OutputBuffer);

            break;
    }
}


void ETH_DMAFrameRx(uint32_t * DstBuf, uint32_t BufferSize, uint32_t * SrcBuf)
{
    __IO uint32_t * ptrControltable;
    uint32_t tmpval;

    MDR_DMA->CHNL_PRIORITY_SET |= (1 << DMARealChannelEthRX);
    DMA_ControlTable[DMARealChannelEthRX].DMA_SourceEndAddr = (uint32_t)SrcBuf;
    DMA_ControlTable[DMARealChannelEthRX].DMA_DestEndAddr = ((uint32_t)DstBuf) + 4 * (BufferSize - 1);
    DMA_ControlTable[DMARealChannelEthRX].DMA_Control = DMA_DestIncWord
                                                  | DMA_SourceIncNo
                                                  | DMA_MemoryDataSize_Word
                                                  | DMA_Mode_AutoRequest
                                                  | DMA_Transfers_1024
                                                  | ((BufferSize - 1) << 4);

    /* Run all channels */
    DMA_Cmd(DMARealChannelEthRX, ENABLE);
    DMA_Request(DMARealChannelEthRX);

    /* Get pointer to DMA control struct */
    ptrControltable = (uint32_t *)&DMA_ControlTable[DMARealChannelEthRX].DMA_Control;

    /* Wait while DMA running */
    while(1)
    {
        tmpval = (*ptrControltable)&0x7;
        if(tmpval == 0)
        {
            break;
        }
    }

    /* Disable DMA channel */
    DMA_Cmd(DMARealChannelEthRX, DISABLE);
}

void ETH_DMAFrameTx(uint32_t * DstBuf, uint32_t BufferSize, uint32_t * SrcBuf)
{
    __IO uint32_t * ptrControltable;
    uint32_t tmpval;

    MDR_DMA->CHNL_PRIORITY_SET |= 1 << DMARealChannelEthTX;

    DMA_ControlTable[DMARealChannelEthTX].DMA_SourceEndAddr = (uint32_t)SrcBuf + 4 * (BufferSize - 1);
    DMA_ControlTable[DMARealChannelEthTX].DMA_DestEndAddr = (uint32_t)DstBuf;
    DMA_ControlTable[DMARealChannelEthTX].DMA_Control = DMA_DestIncNo
                                                  | DMA_SourceIncWord
                                                  | DMA_MemoryDataSize_Word
                                                  | DMA_Mode_AutoRequest
                                                  | DMA_Transfers_1024
                                                  | ((BufferSize - 1) << 4);

    /* Run channel */
    DMA_Cmd(DMARealChannelEthTX, ENABLE);
    DMA_Request(DMARealChannelEthTX);

    /* Get pointer to DMA control struct */
    ptrControltable = (uint32_t *)&DMA_ControlTable[DMARealChannelEthTX].DMA_Control;

    /* Wait while DMA running */
    while(1)
    {
        tmpval = (*ptrControltable)&0x7;
        if(tmpval == 0)
        {
            break;
        }
    }

    /* Disable DMA channel */
    DMA_Cmd(DMARealChannelEthTX, DISABLE);
}


/** @} */ /* End of group ETH_Private_Functions */

/** @} */ /* End of group ETHERNET */

/** @} */ /* End of group __MDR1986VK01_StdPeriph_Driver */

/******************* (C) COPYRIGHT 2022 Milandr ********************************
*
* END OF FILE MDR1986VK01_eth.c */


